reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "g_RC86Xssln3ODZQyS5GuQ"], ["updated_at", "2019-04-09 22:25:29.118387"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!