reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "1234"], ["url", "1234"], ["content", "adfs"], ["sub_id", 5], ["user_id", 1], ["created_at", "2019-04-09 22:35:16.773584"], ["updated_at", "2019-04-09 22:35:16.773584"]]
---
  def create
    # byebug
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save!