reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save!
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    @sub = current_user.subs.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def update
     @sub = current_user.subs.find(params[:id])

     if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", " /r/AskReddit"], ["description", "/r/AskReddit is the place to ask and answer thought-provoking questions."], ["updated_at", "2019-04-09 21:44:00.951398"], ["id", 1]]